# GreaterThanOrEqual Operator (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementId..::..GreaterThanOrEqual Operator
ElementId Class See Also
---
Determines whether one element id is not less than another element id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator >=(
	ElementId elementId1,
	ElementId elementId2
)
```

Visual Basic
---
```text
Public Shared Operator >= ( _
	elementId1 As ElementId, _
	elementId2 As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator >=(
	ElementId^ elementId1,
	ElementId^ elementId2
)
```

# ### Parameters
elementId1
    Type: Autodesk.Revit.DB..::..ElementIdThe first ElementId.
elementId2
    Type: Autodesk.Revit.DB..::..ElementIdThe second ElementId.
# ### Return Value
True if the first element id is not less than the second element id, otherwise, false.
# See Also
ElementId Class
Autodesk.Revit.DB Namespace